Documents/ЛБ_РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РасходныйКассовыйОрдер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРКО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомераРКО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийРКО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выдано</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КорпоративныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДУЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзLX</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийРКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаПереоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПроцентовПоЗаявке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратРазницыРеализацииНевостребованногоЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЦентральнуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВКассуЛомбарда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДляСдачиНаРасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДляЗачисленияНаКорпоративнуюКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДепонированнойЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходныеОперацииПоСогласованиюСЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходныеОперацииПоСогласованиюСЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводныйРКО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_КассоваяСменаСтатус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_КассоваяСменаСтатус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассовыйДеньЗакрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_РасходныйКассовыйОрдер/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;

	Если Параметры.Свойство("КопироватьИзДокумента") Тогда  
		ЗаполнитьДокументКопированием(Параметры.КопироватьИзДокумента); 
		Если НЕ ТекПользователь.ЭтоЛомбард Тогда
       		Объект.Ответственный = ТекПользователь;
		Иначе
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;	 	  		 
		НовыйДокумент = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Если Параметры.Свойство("Организация") Тогда 
			Объект.Организация = Параметры.Организация;
		Иначе	
		    Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
		КонецЕсли;	
		Если Параметры.Свойство("Ломбард") Тогда 
			Объект.Ломбард = Параметры.Ломбард;
		Иначе	
		    Объект.Ломбард = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь); 
		КонецЕсли;	 
	    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
       		Объект.Ответственный = ТекПользователь;
		Иначе
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;	 	
		НовыйДокумент = Истина;     
	//Иначе
	//	ЭтаФорма.ИспользоватьРежимПроведения = ИспользованиеРежимаПроведения.Неоперативный;	
	КонецЕсли;	 
	
	Если ПроверитьКассовыйДеньЗакрыт() Тогда
		Этаформа.ТолькоПросмотр = Истина;
	Иначе	
		Если Объект.Проведен Тогда  
			Этаформа.ТолькоПросмотр = Истина; 
			Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьОтменаКО(Объект.Ссылка) Тогда
				Если НЕ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратПроцентов И 
					 НЕ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратПроцентовПоЗаявке И
					 НЕ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратРазницыРеализацииНевостребованногоЗалога И
					 НЕ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.РасходныеОперацииПоСогласованиюСЦО Тогда 
					 
					Если ЛБ_ОбщийМодуль.КассовыеСменаСовпадаетСТекущей(Объект) Тогда 
						Если ТекущаяДатаСеанса() - Объект.Дата < 3600 Тогда  
							ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаРедактировать.Видимость = Истина;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли; 
	КонецЕсли;	
		
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	УстановитьВидимостьПоВидуОперации(); 
	УстановитьСтатусДокумента();     
	Если ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		ОтделениеЛомбарда = ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДатаСеанса()), Объект.Ломбард); 
	КонецЕсли;	   
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.Инкассация") ИЛИ
	     Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.Недостача") Тогда 
        Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		   Элементы.Контрагент.ТолькоПросмотр = Истина; 
		   Элементы.Выдано.ТолькоПросмотр = Истина;
	   КонецЕсли;	   
    КонецЕсли;  
    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
	    Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
		   СотрудникЦО = Истина;
	    КонецЕсли;
	КонецЕсли;   
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьДокументКопированием(ИзДокумента);
	Для каждого Реквизит Из Метаданные.Документы.ЛБ_РасходныйКассовыйОрдер.Реквизиты Цикл 
		Объект[Реквизит.Имя] = ИзДокумента[Реквизит.Имя];
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НовыйДокумент Тогда
		СформироватьНомерДокумента(); 
		ЭтаФорма.Заголовок = "Расходный кассовый ордер (создание)";
	Иначе
		ЭтаФорма.Заголовок = "Расходный кассовый ордер № " + СокрЛП(Объект.ПредставлениеНомераРКО) + " от " + Формат(Объект.Дата, "ДЛФ=DT"); 
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.СводныйРКО") Тогда
			Элементы.ГруппаОсновная.Видимость = Ложь;
			Элементы.ГруппаРеквизиты.Видимость = ложь;
		    Элементы.ВидОперации.Видимость = Ложь;
			ЭтаФорма.ТолькоПросмотр = Истина;  
			ЭтаФорма.Заголовок = "Сводный расходный кассовый ордер № " + СокрЛП(Объект.ПредставлениеНомераРКО) + " от " + Формат(Объект.Дата, "ДЛФ=DT"); 
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьОткрытуюКассовуюСмену() 
	Возврат ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(?(НовыйДокумент И НЕ СотрудникЦО, ТекущаяДатаСеанса(), Объект.Дата), Объект.Организация, Объект.Ломбард);
КонецФункции

&НаСервере
Функция ПроверитьКассовыйДеньЗакрыт()
	СтруктураКС = ЛБ_ОбщийМодуль.ПолучитьТекущийСтатусКассовойСмены(КонецДня(Объект.Дата), Объект.Организация, Объект.Ломбард);
	Если НЕ СтруктураКС = неопределено Тогда
		Если СтруктураКС.Статус = Перечисления.ЛБ_КассоваяСменаСтатус.КассовыйДеньЗакрыт Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
		СтруктураКС = ПолучитьОткрытуюКассовуюСмену();
		Если СтруктураКС = неопределено Тогда
			Отказ = Истина;
			Сообщить("Необходимо открыть кассовую смену в ломбарде!");
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьСтатусДокумента()  
	Если Объект.Проведен Тогда 
		ЭтаФорма.СтатусДокумента = "ФАКТ"; 
		Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Зеленый;
	Иначе
		ЭтаФорма.СтатусДокумента = "ПРОЕКТ"; 
		Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СформироватьНомерДокумента()  
	Объект.НомерРКО = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерРКО(Объект.Дата, Объект.Организация, Объект.Ломбард); 
	Объект.ПредставлениеНомераРКО = СокрЛП(Объект.Ломбард.НомерЛомбарда) + "/" + СокрЛП(Объект.НомерРКО);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоВидуОперации() 
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаДляЗачисленияНаКорпоративнуюКарту Тогда
		Элементы.БанковскаяКарта.Видимость = Истина; 
	Иначе
		Элементы.БанковскаяКарта.Видимость = Ложь; 
	КонецЕсли;
	
	//Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ОплатаКонтрагента ИЛИ 
	//	 ((Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.РасходныеОперацииПоСогласованиюСЦО ИЛИ
	//	   Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПрочиеРасходныеОперацииПоСогласованиюСЦО) И НЕ ТипКонтрагентаКлиент(Объект.Контрагент)) Тогда
	//	Элементы.ДУЛ.РедактированиеТекста = Истина; 		
	//Иначе
	//	Элементы.ДУЛ.РедактированиеТекста = Ложь; 
	//КонецЕсли;	
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратПроцентовПоЗаявке ИЛИ
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПередачаВЦентральнуюКассу ИЛИ
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПередачаВКассуЛомбарда ИЛИ
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаДляЗачисленияНаКорпоративнуюКарту ИЛИ  
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаДляСдачиНаРасчетныйСчет ИЛИ
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.Недостача Тогда
		Элементы.Основание.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Основание.ТолькоПросмотр = Ложь;
	КонецЕсли;	
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПередачаВКассуЛомбарда Тогда 
		Элементы.ДополнительнаяИнформация.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПередачаВКассуЛомбарда Или 
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПередачаВЦентральнуюКассу Тогда
		Элементы.Выдано.ТолькоПросмотр = Ложь; 
	Иначе
		Элементы.Выдано.ТолькоПросмотр = Истина; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчанию()
	Результат = ЛБ_ОбщийМодуль.ЗаполнитьДтКт(Объект.ВидОперации);
	Объект.Дт = Результат.Дт;
	Объект.Кт = Результат.Кт;
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПередачаВЦентральнуюКассу Тогда
	    Объект.Контрагент = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;     
       Элементы.Контрагент.ТолькоПросмотр = Истина;
    ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.Инкассация ИЛИ
	          Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.Недостача Тогда 
       Объект.Контрагент = Объект.Ответственный.ФизическоеЛицо;
	   Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		   Объект.ФизическоеЛицо = Объект.Контрагент;
		   Элементы.Контрагент.ТолькоПросмотр = Истина; 
		   Объект.Выдано = СокрЛП(Объект.ФизическоеЛицо);
		   Элементы.Выдано.ТолькоПросмотр = Истина;  
	   КонецЕсли;	   
    Иначе                                          
	   Элементы.Контрагент.ТолькоПросмотр = Ложь;
    КонецЕсли;    
КонецПроцедуры    

&НаСервере
Функция ДокументКлиентаВСтроку(Документ)  
	Если ЗначениеЗаполнено(Документ) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", ?(НовыйДокумент, ТекущаяДатаСеанса(), Объект.Дата));  
		Запрос.УстановитьПараметр("ДокументЗалогодателя", Документ);
		Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
			               |ИЗ
			               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
			               |			&Дата,
			               |			ДокументЗалогодателя = &ДокументЗалогодателя
			               |				И ОсновнойДУЛ = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Период УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Информация = "";
			Информация = СокрЛП(Выборка.ВидДокумента);
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСерия), " " + СокрЛП(Выборка.ДокументСерия), "");
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНомер), " " + СокрЛП(Выборка.ДокументНомер), "");
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКемВыдан), " выдан " + СокрЛП(Выборка.ДокументКемВыдан), "");
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументДатаВыдачи), " " + Формат(Выборка.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy"), "");
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения), " код подр. " + СокрЛП(Выборка.ДокументКодПодразделения), "");
			Возврат Информация;
		КонецЕсли;  
	КонецЕсли;	
	Возврат	"";	
КонецФункции  

&НаСервере
Функция ФИО(Клиент) 
	Если ЗначениеЗаполнено(Клиент) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Клиент", Клиент); 
		Запрос.УстановитьПараметр("Дата", ?(НовыйДокумент, ТекущаяДатаСеанса(), Объект.Дата));
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
		               |ИЗ
		               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + ?(НЕ ПустаяСтрока(Выборка.Отчество), " " + СокрЛП(Выборка.Отчество), "");
		КонецЕсли; 
	КонецЕсли;	
	Возврат "";
КонецФункции	

&НаСервере
Функция ПолучитьОсновнойДУЛ(Клиент) 
	Если ЗначениеЗаполнено(Клиент) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Клиент", Клиент); 
		Запрос.УстановитьПараметр("Дата", ?(НовыйДокумент, ТекущаяДатаСеанса(), Объект.Дата));
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя
		               |ИЗ
		               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
		               |			&Дата,
		               |			ДокументЗалогодателя.Владелец = &Клиент
		               |				И ОсновнойДУЛ = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ДокументЗалогодателя;
		КонецЕсли;     
	КонецЕсли;	
	Возврат Справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка();
КонецФункции      

&НаСервере
Функция ДокументФизЛица()   
	Информация = "Паспорт РФ";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.ФизическоеЛицо); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.Гражданство КАК Гражданство,
	               |	ФизическиеЛица.СерияДокумента КАК СерияДокумента,
	               |	ФизическиеЛица.НомерДокумента КАК НомерДокумента,
	               |	ФизическиеЛица.КемВыданДокумент КАК КемВыданДокумент,
	               |	ФизическиеЛица.КодПодразделенияДокумента КАК КодПодразделенияДокумента,
	               |	ФизическиеЛица.ДатаВыдачиДокумента КАК ДатаВыдачиДокумента
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ФизическиеЛица.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда		
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.СерияДокумента), " " + СокрЛП(Выборка.СерияДокумента), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.НомерДокумента), " " + СокрЛП(Выборка.НомерДокумента), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.КемВыданДокумент), " выдан " + СокрЛП(Выборка.КемВыданДокумент), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДатаВыдачиДокумента), " " + Формат(Выборка.ДатаВыдачиДокумента,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.КодПодразделенияДокумента), " код подр. " + СокрЛП(Выборка.КодПодразделенияДокумента), "");
	КонецЕсли;     
		
	Возврат Информация;
КонецФункции


&НаСервере
Процедура ЗаполнитьДопРеквизиты()
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратПроцентов Тогда
		Объект.Выдано = ФИО(Объект.Контрагент); 
        Объект.Основание = "Возврат излишне начисленных процентов по ЗБ № " + СокрЛП(Объект.ЗалоговыйБилет.НомерЗалоговогоБилета) + " от " + Формат(Объект.ЗалоговыйБилет.Дата, "ДФ=dd.MM.yyyy"); 
        Объект.ДУЛ = ДокументКлиентаВСтроку(Объект.ДокументКлиента); 
		Объект.Приложение = "";
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратПроцентовПоЗаявке Тогда 
		Объект.Выдано = ФИО(Объект.Контрагент); 
        Объект.Основание = "Возврат излишка денежных средств по заявлению клиента"; 
	    Объект.ДУЛ = ДокументКлиентаВСтроку(Объект.ДокументКлиента);  
		Объект.Приложение = "";  
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ОплатаКонтрагента Тогда 
		Объект.Выдано = ФИО(Объект.Контрагент);
        Объект.Основание = ""; 
	    Объект.Приложение = "";
		Объект.ДУЛ = ДокументКлиентаВСтроку(Объект.ДокументКлиента); 
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВозвратРазницыРеализацииНевостребованногоЗалога Тогда
		Объект.Выдано = ФИО(Объект.Контрагент); 
        Объект.Основание = "Возврат разницы от реализации предмета залога ЗБ № " + СокрЛП(Объект.ЗалоговыйБилет.НомерЗалоговогоБилета) + " от " + Формат(Объект.ЗалоговыйБилет.Дата, "ДФ=dd.MM.yyyy"); 
	    Объект.ДУЛ = ДокументКлиентаВСтроку(Объект.ДокументКлиента);  
		Объект.Приложение = "";	
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПередачаВКассуЛомбарда Тогда  
		НомерЛомбарда = ?(ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.ЛБ_Ломбарды"), СокрЛП(Объект.Контрагент.НомерЛомбарда), "");
        Объект.Основание = "Передача денежных средств в кассу ломбарда № " + НомерЛомбарда + " на ссудно-залоговые операции";
		Объект.ДУЛ = ДокументФизЛица();
	    Объект.Приложение = ""; 
		Объект.ДополнительнаяИнформация = "Ломбард № " + НомерЛомбарда;
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПередачаВЦентральнуюКассу Тогда  
	    Объект.Основание = "Передача денежных средств между операционной и центральной кассами";
		Объект.ДУЛ = ДокументФизЛица();
	    Объект.Приложение = "";   	
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаДляЗачисленияНаКорпоративнуюКарту Тогда
        Объект.Основание = "Сдача наличных в банк"; 
	    Объект.Приложение = "Чек № ____ от ________";  
		Объект.ДУЛ = ДокументФизЛица();
		Объект.ДополнительнаяИнформация = "Чек № ____ от ________";;
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаДляСдачиНаРасчетныйСчет Тогда
        Объект.Основание = "Сдача наличных в банк"; 
	    Объект.Приложение = "Квитанция № ____ от ________";
	    Объект.ДУЛ = ДокументФизЛица();  
		Объект.ДополнительнаяИнформация = "Квитанция № ____ от ________";
    ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.Инкассация Тогда
        Объект.Основание = "Инкассация денежных средств по квитанции к сумке №__ "; 
	    Объект.Приложение = "";  
		Объект.ДУЛ = ДокументФизЛица();
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыдачаПодОтчет Тогда
        Объект.Основание = "Выдача денежных средств под отчет"; 
	    Объект.Приложение = "Служебная записка от";	
		Объект.ДУЛ = ДокументФизЛица();   
		Объект.ДополнительнаяИнформация = "Служебная записка от";
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыплатаЗарплаты Тогда
        Объект.Основание = ""; 
	    Объект.Приложение = "";
		Объект.ДУЛ = ДокументФизЛица();  
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ВыплатаДепонированнойЗарплаты Тогда
        Объект.Основание = ""; 
	    Объект.Приложение = "";
		Объект.ДУЛ = ДокументФизЛица();
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.Недостача Тогда
        Объект.Основание = "Недостача по результатам пересчета денежных средств"; 
	    Объект.Приложение = "";
		Объект.ДУЛ = ДокументФизЛица();
    ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.Недостача Тогда
        Объект.Основание = "Недостача по результатам пересчета денежных средств"; 
	    Объект.Приложение = "";
		Объект.ДУЛ = ДокументФизЛица();
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.РасходныеОперацииПоСогласованиюСЦО ИЛИ 
		      Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРКО.ПрочиеРасходныеОперацииПоСогласованиюСЦО Тогда  
		Если ТипКонтрагентаКлиент(Объект.Контрагент) Тогда 
			Объект.Выдано = ФИО(Объект.Контрагент);
	        Объект.Основание = ""; 
		    Объект.Приложение = "";
			Объект.ДУЛ = ДокументКлиентаВСтроку(Объект.ДокументКлиента); 
		Иначе	
	        Объект.Основание = ""; 
		    Объект.Приложение = "";
			Объект.ДУЛ = ДокументФизЛица(); 
		КонецЕсли;	
    КонецЕсли;	   
КонецПроцедуры

&НаСервере
Процедура ОчиститьПолучателя()  		
	Объект.Контрагент = неопределено;  
	Объект.Выдано = "";   
	Объект.ДУЛ = "";
	Объект.ДокументКлиента = Справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка();  
	Объект.ЗалоговыйБилет = Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
	Объект.ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	Объект.ДополнительнаяИнформация = "";
	Объект.Приложение = "";
	Объект.Основание = "";
КонецПроцедуры


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент) 
	УстановитьВидимостьПоВидуОперации(); 
	ОчиститьПолучателя();
	ЗаполнитьЗначенияПоУмолчанию(); 
	ЗаполнитьДопРеквизиты();	
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерЗБ() 
	Возврат Объект.ЗалоговыйБилет.НомерЗалоговогоБилета;
КонецФункции

&НаСервере
Функция ПолучитьЛомбардыОтделения() 
	Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардыВОтделении(?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДатаСеанса()), ОтделениеЛомбарда, Объект.Ломбард); 
КонецФункции

&НаСервере
Функция ТипКонтрагентаКлиент(Контрагент)
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.ЛБ_Залогодатели") Тогда
	    Возврат Истина;
	КонецЕсли;	       
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Предупреждение("Выберите вид операции!", 60);
		Возврат
	КонецЕсли;	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПолучателя",ЭтаФорма);
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ПередачаВЦентральнуюКассу") Или 
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ПередачаВКассуЛомбарда") Тогда 
		Если ЗначениеЗаполнено(ОтделениеЛомбарда) И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ПередачаВКассуЛомбарда") Тогда 
			СписокВыбора = ПолучитьЛомбардыОтделения(); 
			ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Элементы.Контрагент); 

			Если ВыбранноеЗначение <> Неопределено Тогда 
			   Объект.Контрагент = ВыбранноеЗначение.Значение; 
			   ЗаполнитьДопРеквизиты();
			КонецЕсли;  
		Иначе	 
		    ОткрытьФорму("Справочник.ЛБ_Ломбарды.ФормаВыбора",,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		КонецЕсли;	
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратПроцентов") ИЛИ
		      Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратРазницыРеализацииНевостребованногоЗалога") Тогда  
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЭтоКасса", Истина);   
		Если ЗначениеЗаполнено(Объект.ЗалоговыйБилет) Тогда 
			ПараметрыФормы.Вставить("Номер", ПолучитьНомерЗБ()); 
		КонецЕсли;	
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателяПоНомеруБилета", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратПроцентовПоЗаявке") ИЛИ  
		      Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ОплатаКонтрагента") Тогда  
		ПараметрыФормы = Новый Структура;  
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
			ПараметрыФормы.Вставить("Залогодатель", Объект.Контрагент); 
		КонецЕсли;	
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.РасходныеОперацииПоСогласованиюСЦО") ИЛИ
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ПрочиеРасходныеОперацииПоСогласованиюСЦО") Тогда
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(1, "Клиент");
		СписокВыбора.Добавить(2, "Физическое лицо");
		ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Элементы.Контрагент); 
		
		Если ВыбранноеЗначение <> Неопределено Тогда  
			Если ВыбранноеЗначение.Значение = 1 Тогда   
				ПараметрыФормы = Новый Структура;  
				Если ЗначениеЗаполнено(Объект.Контрагент) И ТипКонтрагентаКлиент(Объект.Контрагент) Тогда 
					ПараметрыФормы.Вставить("Залогодатель", Объект.Контрагент); 
				КонецЕсли;	
				ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
			ИначеЕсли ВыбранноеЗначение.Значение = 2 Тогда
				ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;	
		КонецЕсли;	
	
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаДляСдачиНаРасчетныйСчет") или
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаДляЗачисленияНаКорпоративнуюКарту") или
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаПодОтчет") или
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыплатаЗарплаты") или 
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыплатаДепонированнойЗарплаты") Тогда 
		
		массивСотрудников = СформироватьМассивСотрудниковОтделения();    		
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Ссылка", массивСотрудников);
		
		ПараметрФормы = Новый Структура;
		ПараметрФормы.Вставить("Отбор", СтруктураОтбора);

		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",ПараметрФормы,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
	Иначе

		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;	 
КонецПроцедуры    

&НаСервере
Процедура ПослеВыбораПолучателя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда 
		Объект.Контрагент = Результат.Залогодатель;
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратПроцентов") ИЛИ 
			 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратРазницыРеализацииНевостребованногоЗалога") Тогда		
		    Объект.ЗалоговыйБилет = Результат.ЗалоговыйБилет;
			Объект.ДокументКлиента = ПолучитьОсновнойДУЛ(Результат.Залогодатель);  
			Объект.ФизическоеЛицо = Результат.Залогодатель;
		Иначе       
			Объект.ФизическоеЛицо = Результат.Залогодатель;
			Объект.ДокументКлиента = Результат.ДокументЗалогодателя; 
		КонецЕсли;	
	Иначе	
	    Объект.Контрагент = Результат;
		Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда 
			Объект.ФизическоеЛицо = Результат;
			Объект.Выдано = СокрЛП(Результат);
		КонецЕсли;	
	КонецЕсли;	     
	ЗаполнитьДопРеквизиты();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьСтатусДокумента() 
КонецПроцедуры

&НаКлиенте
Процедура ВыданоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратПроцентов") Или
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратПроцентовПоЗаявке") Или
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратРазницыРеализацииНевостребованногоЗалога") Тогда
		Возврат;
	КонецЕсли;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ПередачаВЦентральнуюКассу") или 
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ПередачаВКассуЛомбарда") или
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаДляСдачиНаРасчетныйСчет") или
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаДляЗачисленияНаКорпоративнуюКарту") или
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаПодОтчет") или  
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыплатаЗарплаты") или
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыплатаДепонированнойЗарплаты") Тогда
				
		массивСотрудников = СформироватьМассивСотрудниковОтделения();    		
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Ссылка", массивСотрудников);
		
		ПараметрФормы = Новый Структура;
		ПараметрФормы.Вставить("Отбор", СтруктураОтбора);
		
		ОбработкаВыбораФЛ = Новый ОписаниеОповещения("ПослеВыбораФЛ",ЭтаФорма);
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",ПараметрФормы,ЭтаФорма,,,, ОбработкаВыбораФЛ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		ОбработкаВыбораФЛ = Новый ОписаниеОповещения("ПослеВыбораФЛ",ЭтаФорма);
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",,ЭтаФорма,,,, ОбработкаВыбораФЛ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры 

Функция СформироватьМассивСотрудниковОтделения() 
	
	ТекДата = ТекущаяДата();
	массив = Новый Массив;
	
	Запрос0 = Новый Запрос;
	Запрос0.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&НаДату, ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	               |ГДЕ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард = &Ломбард"; 
	Запрос0.УстановитьПараметр("НаДату", ТекДата);
	Запрос0.УстановитьПараметр("Ломбард", Объект.Ломбард); 
	
	Отделен = Неопределено;
	Выборка = Запрос0.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отделен = Выборка.Отделение;
	КонецЕсли;  
	
	Если Отделен <> Неопределено Тогда
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	               |			&НаДату,
	               |			Отделение = &Отделение
	               |				И Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних"; 
	Запрос.УстановитьПараметр("НаДату", ТекДата);
	Запрос.УстановитьПараметр("Отделение", Отделен);

	тз = Запрос.Выполнить().Выгрузить(); 
	массивЛомб = тз.ВыгрузитьКолонку("Ссылка");	
	
				   
	
	Запрос2 = Новый Запрос; 
	Запрос2.Текст = "ВЫБРАТЬ
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Ломбард,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия КАК ВидСобытия,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо
	                |ИЗ
	                |	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&НаДату, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	                |ГДЕ
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение В(&Подразделение)
	                |	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> &ВидСобытия
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение.НомерЛомбарда";
	Запрос2.УстановитьПараметр("НаДату", ТекДата);
	Запрос2.УстановитьПараметр("Подразделение", массивЛомб); 
	Запрос2.УстановитьПараметр("ВидСобытия", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение);
	         	

	Выборка = Запрос2.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидСобытия = Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение Тогда
			Продолжить;
		КонецЕсли;
		массив.Добавить(Выборка.ФизическоеЛицо);
		
	КонецЦикла;
	КонецЕсли;

	Возврат Массив;

КонецФункции

&НаСервере
Процедура ПослеВыбораФЛ(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;	 
	
	Объект.ФизическоеЛицо = Результат;
	Объект.Выдано = СокрЛП(Объект.ФизическоеЛицо); 
	ЗаполнитьДопРеквизиты();
КонецПроцедуры

&НаСервере
Функция ПолучитьОтделение()
	Возврат ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДатаСеанса()), Объект.Ломбард);
КонецФункции

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)   
	ОтделениеЛомбарда = ПолучитьОтделение(); 
	СформироватьНомерДокумента(); 
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		ЭтаФорма.Заголовок = "Расходный кассовый ордер № " + СокрЛП(Объект.ПредставлениеНомераРКО) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыданоПриИзменении(Элемент)
	ЗаполнитьДопРеквизиты();
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущуюДатуСеанса()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура КонтрагентОткрытие(Элемент, СтандартнаяОбработка)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратПроцентов") ИЛИ
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратПроцентовПоЗаявке") ИЛИ
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВозвратРазницыРеализацииНевостребованногоЗалога") ИЛИ
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ОплатаКонтрагента") Тогда 
		СтандартнаяОбработка = Ложь; 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Объект.Контрагент);
		ПараметрыФормы.Вставить("Дата", ?(НовыйДокумент, ПолучитьТекущуюДатуСеанса(), Объект.Дата));	
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма);  
	ИначеЕсли (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.РасходныеОперацииПоСогласованиюСЦО") ИЛИ 
		       Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ПрочиеРасходныеОперацииПоСогласованиюСЦО")) И ТипКонтрагентаКлиент(Объект.Контрагент) Тогда
		СтандартнаяОбработка = Ложь; 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Объект.Контрагент);
		ПараметрыФормы.Вставить("Дата", ?(НовыйДокумент, ПолучитьТекущуюДатуСеанса(), Объект.Дата));	
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма); 	   
	Иначе
		СтандартнаяОбработка = Истина; 
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура БанковскаяКартаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	ОбработкаВыбораБК = Новый ОписаниеОповещения("ПослеВыбораБК",ЭтаФорма);
	ПараметрыФормы = Новый Структура; 
	Отделение = ПолучитьОтделение();
	Если Отделение = неопределено Тогда
		ПараметрыФормы.Вставить("ВыборОтделение", Ложь);
	Иначе	                    
		ПараметрыФормы.Вставить("ВыборОтделение", Истина);
	    ПараметрыФормы.Вставить("Отделение", Отделение);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ТекДата", ?(НовыйДокумент, ПолучитьТекущуюДатуСеанса(), Объект.Дата));
	ОткрытьФорму("Справочник.ЛБ_КорпоративныеКарты.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбораБК, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораБК(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;	 
	
	Объект.БанковскаяКарта = Результат;
КонецПроцедуры

&НаСервере
Процедура ОтменитьПроведение()  
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	ЭтаФорма.ТолькоПросмотр = Ложь;
	ОтменитьПроведение();
	УстановитьСтатусДокумента(); 
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаРедактировать.Видимость = Ложь;  
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.Инкассация") ИЛИ
	     Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.Недостача") Тогда 
        Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		   Элементы.Контрагент.ТолькоПросмотр = Истина; 
		   Элементы.Выдано.ТолькоПросмотр = Истина;
	   КонецЕсли;	   
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияПриИзменении(Элемент) 
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаДляЗачисленияНаКорпоративнуюКарту") ИЛИ
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаДляСдачиНаРасчетныйСчет") ИЛИ
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаПодОтчет") Тогда
	    Объект.Приложение = Объект.ДополнительнаяИнформация;  
	КонецЕсли;	
КонецПроцедуры

//+МАН Выведена нестандартная кнопка печати. Заявка 2936
&НаКлиенте
Процедура Печать(Команда)
	Если Объект.Проведен Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", "РКО"); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_РасходныйКассовыйОрдер");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект.Ссылка);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
	Иначе
		Предупреждение("Печать непроведенного документа запрещена!");
	КонецЕсли;	
КонецПроцедуры
//-МАН
